# Section 6. 데이터프레임과 슬라이스에서 elements 다루기

- 데이터프레임 내의 elements를 다루었으나, 슬라이스/서브셋에서 원소만 다루고 원래 DF는 변경되지 않은 채로 유지하는 오류
- DF의 슬라이스/복사본 내의 원소 조작. but, 코드는 원본 DF에서의 해당 elements까지 조작하는 오류

# Manipluating Values in DataFrame

## Best Practise (how you should it)

- 하나의 원소가 아니라 행, 열 안에서 여러 개의 원소를 한번에 바꾸려면?

In [ ]:
import pandas as pd

In [ ]:
titanic = pd.read_csv("titanic.csv")

In [ ]:
titanic.head()

### Changing a single Value (Option 1 with loc)

In [ ]:
titanic.loc[1, "age"] = 40

In [ ]:
titanic.head()

### Changing a single Value (Option 2 with iloc)

In [ ]:
titanic.iloc[1,3] = 41

In [ ]:
titanic.head()

### Changing multiple values in a column (Option 1 with loc)

In [ ]:
titanic.loc[1:3, "age"] = 42

In [ ]:
titanic.head()

### Changing multiple values in a column (Option 2 with iloc)

In [1]:
import pandas as pd
titanic = pd.read_csv("titanic.csv")

In [2]:
onetothree = [43, 44, 45]
titanic.iloc[1:4, 3] = onetothree

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  43.0      1      0  71.2833        C    C
2         1       3  female  44.0      0      0   7.9250        S  NaN
3         1       1  female  45.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

### Changing multiple values in a column (Option 3 with boolean indexing)

In [4]:
# titanic.loc[titanic.age < 1, "age"] 까지 하면 titanic df에서 age열의 값이 1 미만인 데이터를 시리즈로 보여줌
# 그리고나서 .index 속성을 이용해 출력하면?  >> 인덱스 객체를 index_babies 인덱스를 이용해서 필터링하여 확인해보자

titanic.loc[titanic.age < 1, "age"]

78     0.83
305    0.92
469    0.75
644    0.75
755    0.67
803    0.42
831    0.83
Name: age, dtype: float64

In [8]:
titanic.loc[titanic.age < 1, "age"] = 1

In [5]:
index_babies = titanic.loc[titanic.age < 1, "age"].index

In [ ]:
titanic.loc[index_babies]

### 한 행에서 여러개의 값 변경

In [10]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  43.0      1      0  71.2833        C    C
2         1       3  female  44.0      0      0   7.9250        S  NaN
3         1       1  female  45.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [11]:
# 방법 1
# titanic.loc[0,"survived":"sex"] = [1,1,"female"]

survived       0
pclass         3
sex         male
Name: 0, dtype: object

- replace 메소드를 이용해서 바꿔보자.

In [12]:
titanic.replace(0, "Zero")

    survived  pclass     sex   age sibsp parch     fare embarked deck
0       Zero       3    male  22.0     1  Zero     7.25        S  NaN
1          1       1  female  43.0     1  Zero  71.2833        C    C
2          1       3  female  44.0  Zero  Zero    7.925        S  NaN
3          1       1  female  45.0     1  Zero     53.1        S    C
4       Zero       3    male  35.0  Zero  Zero     8.05        S  NaN
..       ...     ...     ...   ...   ...   ...      ...      ...  ...
886     Zero       2    male  27.0  Zero  Zero     13.0        S  NaN
887        1       1  female  19.0  Zero  Zero     30.0        S    B
888     Zero       3  female   NaN     1     2    23.45        S  NaN
889        1       1    male  26.0  Zero  Zero     30.0        C    C
890     Zero       3    male  32.0  Zero  Zero     7.75        Q  NaN

[891 rows x 9 columns]